var data=[];
var dataStr='1、两小无猜<br>\
<br>\
导演：杨·塞谬尔<br>\
编剧：杨·塞谬尔 <br>\
主演：吉约姆·卡内，玛丽昂·歌迪亚，吉尔·勒卢什<br>\
类型：剧情、爱情<br>\
制片国家/地区：法国；比利时 <br>\
语言：法语<br>\
上映日期：2003年9月17日<br>\
片长：93 分钟<br>\
一句话感言：游戏人生，见证爱情。<br>\
<br>\
<br>\
2、恐惧吞噬灵魂<br>\
<br>\
导演：赖纳·维尔纳·法斯宾德<br>\
编剧：赖纳·维尔纳·法斯宾德<br>\
主演：布里奇特·米拉，埃尔·赫迪·本·萨利姆，芭芭拉·瓦伦汀<br>\
类型：剧情、爱情<br>\
制片国家/地区：德国<br>\
语言：德语、阿拉伯语<br>\
上映日期：1974年3月5日（德国）<br>\
片长：93分钟（德国）<br>\
一句话感言：爱情无界限（不分年龄，不分国度）。<br>\
<br>\
<br>\
3、时时刻刻<br>\
<br>\
导演：史蒂芬·戴德利<br>\
编剧：戴维·黑尔、迈克尔·坎宁安 <br>\
主演：妮可·基德曼、朱丽安·摩尔、梅丽尔·斯特里普<br>\
类型：剧情电影<br>\
制片国家/地区：美国 <br>\
语言：英语<br>\
上映日期：2002年12月18日在美国上映<br>\
片长：114分钟<br>\
一句话感言：生命诚可贵。<br>\
<br>\
<br>\
4、诺丁山<br>\
<br>\
导演：罗杰·米歇尔<br>\
编剧：理查德·柯蒂斯 <br>\
主演：朱莉娅·罗伯茨，休·格兰特，瑞斯·伊凡斯，迪兰·莫兰，约翰·斯拉普内尔，米莎·巴顿<br>\
类型：爱情<br>\
制片国家/地区：英国，美国<br>\
语言：英语，西班牙语<br>\
上映日期：1999年5月28日<br>\
片长：124分钟<br>\
一句话感言：身边的浪漫。<br>\
<br>\
<br>\
5、美国往事<br>\
<br>\
导演：Sergio Leone<br>\
编剧：Piero De Bernardi， Leonardo Benvenuti<br>\
主演：罗伯特·德尼罗，詹姆斯·伍兹，伊丽莎白·麦戈文，塔斯黛·韦尔德<br>\
类型：剧情，犯罪<br>\
制片国家/地区：意大利，美国<br>\
语言：英语，法语，意大利语<br>\
上映日期：1984-02-17(意大利)<br>\
片长：255分钟<br>\
一句话感言：帅哥美女真多，看完很舒服。<br>\
<br>\
<br>\
6、搏击俱乐部<br>\
<br>\
导演：David Fincher<br>\
编剧：Chuck Palahniuk， Jim Uhls<br>\
主演：布拉德·皮特，爱德华·诺顿，海伦娜·伯翰·卡特<br>\
类型：剧情，悬疑，惊悚<br>\
制片国家/地区：美国，德国<br>\
语言：英语<br>\
上映日期：1999年10月15日（美国）<br>\
片长：139min<br>\
一句话感言：刺激的人生。<br>\
<br>\
<br>\
7、廊桥遗梦<br>\
<br>\
导演：克林特·伊斯特伍德<br>\
编剧：理查德·拉<br>\
主演：梅丽尔·斯特里普，克林特·伊斯特伍德<br>\
类型：爱情<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：1995年<br>\
片长：127分钟<br>\
一句话感言：这么确切的爱，一生只有一次。<br>\
<br>\
<br>\
8、走出非洲<br>\
<br>\
导演：西德尼·波拉克<br>\
编剧：卡琳·布里克森<br>\
主演：梅丽尔·斯特里普，罗伯特·雷德福，克劳斯·马利亚·布朗道尔<br>\
类型：爱情，剧情，传记，冒险<br>\
制片国家/地区：美国<br>\
语言：英语，斯瓦希里语<br>\
上映日期：1985年12月10日<br>\
片长：150分钟<br>\
一句话感言：探索自然，用爱情交织。<br>\
<br>\
<br>\
9、魂断蓝桥<br>\
<br>\
导演：茂文·勒鲁瓦、梅尔文·勒罗伊<br>\
编剧：George Froeschel、HansRameau<br>\
主演：费雯·丽，罗伯特·泰勒，露塞尔·沃特森，弗吉尼亚·菲尔德<br>\
类型：爱情<br>\
制片国家/地区：美国<br>\
语言：英语<br>\
上映日期：1940年5月17日<br>\
片长：108min<br>\
一句话感言：一见钟情只见于男才女貌身上。<br>\
<br>\
<br>\
10、罗马假日<br>\
<br>\
导演：威廉·惠勒<br>\
编剧：达尔顿·特朗勃<br>\
主演：奥黛丽·赫本，格里高利·派克<br>\
类型：爱情<br>\
制片国家/地区：美国、意大利<br>\
语言：英语<br>\
上映日期：1953年8月27日<br>\
片长：118min<br>\
一句话感言：因为爱，可以不分贵贱。<br>\
<br>\
<br>\
11、海上钢琴师<br>\
<br>\
导演：吉赛贝·托纳多雷<br>\
编剧：亚历山大·巴利科<br>\
主演：蒂姆·罗斯，比尔·努恩，梅兰尼·蒂埃里<br>\
类型：剧情，爱情，音乐<br>\
制片国家/地区：意大利<br>\
语言：英语，法语<br>\
上映日期：1998年10月28日<br>\
片长：165min<br>\
一句话感言：孤独的绝唱。<br>\
<br>\
<br>\
12、放牛班的春天<br>\
<br>\
导演：克里斯托夫·巴拉蒂<br>\
编剧：克里斯托夫·巴拉蒂 / Philippe Lopes-Curval<br>\
主演： 热拉尔 ·朱诺弗，朗索瓦 ·贝雷昂，雅克 ·贝汉<br>\
类型：剧情/音乐<br>\
制片国家/地区：法国，德国，瑞士<br>\
语言：法语<br>\
上映日期：2004年3月17日(法国)<br>\
片长：97min<br>\
一句话感言：对孩子有耐心。<br>\
<br>\
';

//为何要这样做呢？就不能直接设置，还要这么麻烦
var d = dataStr.split('<br><br><br>');
for(var i=0;i<d.length;i++){
  var c = d[i].split('<br><br>');
  data.push({
    img:c[0].replace('、',' ')+'.jpg',
    caption:c[0].split('、')[1],
    desc:c[1]
  });
  //console.log(c[0].replace('、',' ')+'.jpg');
}

	